## Titanic - Machine learining from disaster
https://www.kaggle.com/c/titanic

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("train.csv") # Загрузили датасет в память

In [3]:
df.head(5) # Посмотрели на данные

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info() # Вывели тип данных по столбцам

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.isnull().sum() # Посчитали количество нулевых значений

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
median_age = df["Age"].median() # Вычислили медианное значение возраста
df["Age"].fillna(median_age, inplace=True) # Заполнили пропуски медианой

/tmp/ipykernel_7148/1408274187.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(median_age, inplace=True) # Заполнили пропуски медианой

In [7]:
mode_embarked = df["Embarked"].mode()[0]  # Вычислили моду по столбцу Embarked
df["Embarked"].fillna(mode_embarked, inplace=True)  # Заполнили пропуски модой

/tmp/ipykernel_7148/292838435.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Embarked"].fillna(mode_embarked, inplace=True)  # Заполнили пропуски модой

In [8]:
df.info()  # Проверили результат после внесенных  изменений

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
df.duplicated().sum() # Посчитали количество дубликатов

0

In [10]:
# Если дубликаты есть, то удалим их
dublicates = df[df.duplicated()] # Выделили дубликаты
df.drop_duplicates(inplace=True) # Удалили дубликаты

In [11]:
# Трансформация данных на случай разных записей male, M, Male, Men etc.
df["Sex"].replace({"male": "M", "female": "F"}, inplace=True) # Заменили текстовые значения на числовые

/tmp/ipykernel_7148/3506937013.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Sex"].replace({"male": "M", "female": "F"}, inplace=True) # Заменили текстовые значения на числовые

In [12]:
df["Sex"].value_counts() # Посчитали количество мужчин и женщин

Sex
M    577
F    314
Name: count, dtype: int64

In [13]:
# Исправление отрицательных значений платы за проезд
df["Fare"] = df["Fare"].abs() # Отрицательные значения заменили на положительные

In [14]:
# Исправление несоответсвий в поле "порт посадки", заменим сокращения в названиях портов
df["Embarked"].replace({"C": "Cherbourg", "Q": "Queenstown", "S": "Southampton"}, inplace=True) # Заменили текстовые значения на числовые

/tmp/ipykernel_7148/1540617109.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Embarked"].replace({"C": "Cherbourg", "Q": "Queenstown", "S": "Southampton"}, inplace=True) # Заменили текстовые значения на числовые

### Обработка категориальных данных

In [15]:
# One-hot encodiing для столбца "пол"
df = pd.get_dummies(df, columns=["Sex"]) # Добавили столбец "M" и удалили столбец "Sex"

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_F,Sex_M
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,Southampton,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,Cherbourg,True,False
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,Southampton,True,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,Southampton,True,False
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,Southampton,False,True

In [18]:
# labe encoding для столбца  "порт посадки" и удаление столбца "порт посадки"
from sklearn.preprocessing import LabelEncoder # Импортируем модуль для кодирования
le = LabelEncoder() # Создали экземпляр класса
df["Embarked"] = le.fit_transform(df["Embarked"].astype(str)) # Применили кодирование к столбцу "порт посадки"

In [19]:
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_F,Sex_M
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,2,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,0,True,False
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,2,True,False
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,2,True,False
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,2,False,True

### Обработка выбросов (outliers)
Методы обработки выбросоов:

1. удаление с помощью стат.методов (z-score, standart devidation, IQR, межквартильный размах)
2. винсоризация (метод ближайших соседей, установка экстримальных значений по процентилям)
3. преобразование данных (преобразование с помощью мат.функций, логарифмирование, корень квадратный)
4. обработка выбросов как отсутсвующих значений  (медиана, мода, среднее арифметическое, межквартильный размах)

#### 1. Z-score

расчитывается z-score для каждой точки данных, показывающий на сколько стандартных отклонений от среднего значения находится данная точка. Те точки которые в результате вычислений превышают заданный порог, считаются выборосами.
Z-score вычисляется по формуле:
$$z = \frac{x - \bar{x}}{\sigma}$$
где $x$ — значение, $\bar{x}$ — среднее значение, $\sigma$ — стандартное отклонение.
Таким образом, если z-score для значения x больше 3, то оно считается выбросом. Если z-score для значения x меньше -3, то оно считается выбросом. Если z-score для значения x находится в промежутке от -3 до 3, то оно не является выбросом.

In [20]:
from scipy import stats # Импортируем модуль для статистической обработки данных
z = np.abs(stats.zscore(df["Fare"])) # Вычислили z-оценку для столбца "платы за проезд"

In [21]:
# Устанавливаем пороговое значение z-scores
threshold = 3

In [22]:
# Выявляем выбросы
outliers = df["Fare"][z > threshold] # Выявили выбросы

In [23]:
df["Fare"].mean(0) # Вычислили среднее значение платы за проезд

32.204207968574636

In [24]:
outliers # Вывели выбросы

27     263.0000
88     263.0000
118    247.5208
258    512.3292
299    247.5208
311    262.3750
341    263.0000
377    211.5000
380    227.5250
438    263.0000
527    221.7792
557    227.5250
679    512.3292
689    211.3375
700    227.5250
716    227.5250
730    211.3375
737    512.3292
742    262.3750
779    211.3375
Name: Fare, dtype: float64

In [26]:
# Замена выбросов на медианные знчения
df.loc[z > threshold, "Fare"] = df["Fare"].median() # Заменили выбросы на медианные значения

In [27]:
df["Fare"].mean() # Вычислили среднее значение платы за проезд

26.25910482603816

#### 2. Winsorization (винсоризация)

Поиск экстримальных значений на определенный перцентиль и их замена

In [32]:
from scipy.stats.mstats import winsorize # Импортируем модуль для Winsorization

In [33]:
df["Fare"] = winsorize(df["Fare"], limits=[0.05, 0.05]) # Применили Winsorization к столбцу "платы за проезд"

In [34]:
df["Fare"].mean()

24.696483389450055

#### 3. Преобразование данных с помощью математических функций

##### Функция логарифма $\log +1 \pi$

сжимает диапазон значений, уменьшая влияние выбросов

In [35]:
df["Fare"] = np.log1p(df["Fare"]) # Применили логарифмирование к столбцу "платы за проезд" и занесли результат в новый столбец

In [36]:
df["Fare"].mean() # Вычислили среднее значение платы за проезд

2.9203914579094272

In [37]:
# Отвлеченный пример на ценах
prices = [10, 20, 30, 40, 50, 1000]
np.log1p(prices) # Вычислили логарифмирование к столбцу "платы за проезд" и занесли результат в новый столбец

array([2.39789527, 3.04452244, 3.4339872 , 3.71357207, 3.93182563,
       6.90875478])

#### 4. Стандартизация данных

Метод стандартизации применяется для преобразования значений в диапазоне от 0 до 1,
где среднее значение равно 0, а стандартное отклонение равно 1

Очень часто применяется в машинном обучении, из точки данных вычитают среднее значение и делят на стандартное отклонение

In [40]:
from sklearn.preprocessing import StandardScaler # Импортируем модуль для стандартизации данных

In [42]:
# Отвлеченный пример
data = np.array([[1, 2], [3, 4], [5, 6], [7, 8]]) # Создали массив с данными
print(data.mean(), data.std()) # Вычислили среднее значение и стандартное отклонение
scaler = StandardScaler() # Создали экземпляр класса
scaled_data = scaler.fit_transform(data) # Применили стандартизацию к массиву с данными
print(scaled_data)
print(scaled_data.mean(), scaled_data.std()) # Вычислили среднее значение и стандартное отклонение

4.5 2.29128784747792
[[-1.34164079 -1.34164079]
 [-0.4472136  -0.4472136 ]
 [ 0.4472136   0.4472136 ]
 [ 1.34164079  1.34164079]]
0.0 1.0